{
 "EntityCommonStockSharesOutstanding": "Indicate number of shares or other units outstanding of each of registrant's classes of capital or common stock or other ownership interests, if and as stated on cover of related periodic report. Where multiple classes or units exist define each class/interest by adding class of stock items such as Common Class A [Member], Common Class B [Member] or Partnership Interest [Member] onto the Instrument [Domain] of the Entity Listings, Instrument.",
 "EntityPublicFloat": "The aggregate market value of the voting and non-voting common equity held by non-affiliates computed by reference to the price at which the common equity was last sold, or the average bid and asked price of such common equity, as of the last business day of the registrant's most recently completed second fiscal quarter.",
 "AccountsPayable": "Carrying value as of the balance sheet date of liabilities incurred (and for which invoices have typically been received) and payable to vendors for goods and services received that are used in an entity's business. For classified balance sheets, used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer); for unclassified balance sheets, used to reflect the total liabilities (regardless of due date).",
 "AccountsPayableCurrent": "Carrying value as of the balance sheet date of liabilities incurred (and for which invoices have typically been received) and payable to vendors for goods and services received that are used in an entity's business. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer).",
 "AccountsReceivableNetCurrent": "Amount, after allowance for credit loss, of right to consideration from customer for product sold and service rendered in normal course of business, classified as current.",
 "AccruedLiabilities": "Carrying value as of the balance sheet date of obligations incurred and payable, pertaining to costs that are statutory in nature, are incurred on contractual obligations, or accumulate over time and for which invoices have not yet been received or will not be rendered. Examples include taxes, interest, rent and utilities. For classified balance sheets, used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer); for unclassified balance sheets, used to reflect the total liabilities (regardless of due date).",
 "AccruedLiabilitiesCurrent": "Carrying value as of the balance sheet date of obligations incurred and payable, pertaining to costs that are statutory in nature, are incurred on contractual obligations, or accumulate over time and for which invoices have not yet been received or will not be rendered. Examples include taxes, interest, rent and utilities. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer).",
 "AccruedLiabilitiesForUnredeeemedGiftCards": "Carrying value as of the balance sheet date of the liability for outstanding gift cards. Retail customers purchase gift cards or gift certificates that can be redeemed at a later date for merchandise or services; those unredeemed represent a liability of the entity because the revenue is being deferred.",
 "AccumulatedDepreciationDepletionAndAmortizationPropertyPlantAndEquipment": "Amount of accumulated depreciation, depletion and amortization for physical assets used in the normal conduct of business to produce goods and services.",
 "AccumulatedOtherComprehensiveIncomeLossAvailableForSaleSecuritiesAdjustmentNetOfTax": "Amount, after tax, of accumulated unrealized gain (loss) on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale).",
 "AccumulatedOtherComprehensiveIncomeLossForeignCurrencyTranslationAdjustmentNetOfTax": "Accumulated adjustment, net of tax, that results from the process of translating subsidiary financial statements and foreign equity investments into the reporting currency from the functional currency of the reporting entity, net of reclassification of realized foreign currency translation gains or losses.",
 "AccumulatedOtherComprehensiveIncomeLossNetOfTax": "Accumulated change in equity from transactions and other events and circumstances from non-owner sources, net of tax effect, at period end. Excludes Net Income (Loss), and accumulated changes in equity from transactions resulting from investments by owners and distributions to owners. Includes foreign currency translation items, certain pension adjustments, unrealized gains and losses on certain investments in debt and equity securities, other than temporary impairment (OTTI) losses related to factors other than credit losses on available-for-sale and held-to-maturity debt securities that an entity does not intend to sell and it is not more likely than not that the entity will be required to sell before recovery of the amortized cost basis, as well as changes in the fair value of derivatives related to the effective portion of a designated cash flow hedge.",
 "AcquiredFiniteLivedIntangibleAssetWeightedAverageUsefulLife": "The calculated weighted-average amortization period of a major class of finite-lived intangible assets acquired during the current period either individually or as part of a group of assets (in either an asset acquisition or business combination). A major class is composed of intangible assets that can be grouped together because they are similar, either by their nature or by their use in the operations of a company.",
 "AdditionalPaidInCapital": "Excess of issue price over par or stated value of the entity's capital stock and amounts received from other transactions involving the entity's stock or stockholders. Includes adjustments to additional paid in capital. Some examples of such adjustments include recording the issuance of debt with a beneficial conversion feature and certain tax consequences of equity instruments awarded to employees. Use this element for the aggregate amount of additional paid-in capital associated with common and preferred stock. For additional paid-in capital associated with only common stock, use the element additional paid in capital, common stock. For additional paid-in capital associated with only preferred stock, use the element additional paid in capital, preferred stock.",
 "AdjustmentsNoncashItemsToReconcileNetIncomeLossToCashProvidedByUsedInOperatingActivitiesOther": "Transactions that do not result in cash inflows or outflows in the period in which they occur, but affect net income and thus are removed when calculating net cash flow from operating activities using the indirect cash flow method. This element is used when there is not a more specific and appropriate element.",
 "AdjustmentsToAdditionalPaidInCapitalTaxEffectFromShareBasedCompensation": "Amount of increase in additional paid in capital (APIC) resulting from a tax benefit associated with share-based compensation plan other than an employee stock ownership plan (ESOP). Includes, but is not limited to, excess tax benefit.",
 "AdvertisingExpense": "Amount charged to advertising expense for the period, which are expenses incurred with the objective of increasing revenue for a specified brand, product or product line.",
 "AllocatedShareBasedCompensationExpense": "Amount of expense for award under share-based payment arrangement. Excludes amount capitalized.",
 "AllowanceForDoubtfulAccountsReceivable": "Amount of allowance for credit loss on accounts receivable.",
 "AllowanceForDoubtfulAccountsReceivableCurrent": "Amount of allowance for credit loss on accounts receivable, classified as current.",
 "AllowanceForDoubtfulAccountsReceivableWriteOffs": "Amount of direct write-downs of accounts receivable charged against the allowance.",
 "AmortizationOfAcquiredIntangibleAssets": "The aggregate expense charged against earnings to allocate the cost of acquired intangible assets. As a noncash expense, this element is added back to net income when calculating cash provided by (used in) operations using the indirect method.",
 "AmortizationOfIntangibleAssets": "The aggregate expense charged against earnings to allocate the cost of intangible assets (nonphysical assets not used in production) in a systematic and rational manner to the periods expected to benefit from such assets. As a noncash expense, this element is added back to net income when calculating cash provided by or used in operations using the indirect method.",
 "AmortizationOfLeasedAsset": "The expense charged against earnings for the periodic recognition of capitalized leases. This element may apply to energy companies that lease mineral producing properties and to other enterprises that capitalize property, plant, or equipment obtained through capital leases.",
 "AntidilutiveSecuritiesExcludedFromComputationOfEarningsPerShareAmount": "Securities (including those issuable pursuant to contingent stock agreements) that could potentially dilute basic earnings per share (EPS) or earnings per unit (EPU) in the future that were not included in the computation of diluted EPS or EPU because to do so would increase EPS or EPU amounts or decrease loss per share or unit amounts for the period presented.",
 "Assets": "Sum of the carrying amounts as of the balance sheet date of all assets that are recognized. Assets are probable future economic benefits obtained or controlled by an entity as a result of past transactions or events.",
 "AssetsCurrent": "Sum of the carrying amounts as of the balance sheet date of all assets that are expected to be realized in cash, sold, or consumed within one year (or the normal operating cycle, if longer). Assets are probable future economic benefits obtained or controlled by an entity as a result of past transactions or events.",
 "AvailableForSaleDebtSecuritiesAmortizedCostBasis": "Amortized cost of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale).",
 "AvailableForSaleSecuritiesDebtMaturitiesAfterFiveThroughTenYearsAmortizedCost": "Amortized cost of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), with single maturity date and allocated without single maturity date, maturing in sixth through tenth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "AvailableForSaleSecuritiesDebtMaturitiesAfterFiveThroughTenYearsFairValue": "Fair value of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), with single maturity date and allocated without single maturity date, maturing in sixth through tenth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "AvailableForSaleSecuritiesDebtMaturitiesAfterOneThroughFiveYearsAmortizedCost": "Amortized cost of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), with single maturity date and allocated without single maturity date, maturing in second through fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "AvailableForSaleSecuritiesDebtMaturitiesAfterOneThroughFiveYearsFairValue": "Fair value of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), with single maturity date and allocated without single maturity date, maturing in second through fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "AvailableForSaleSecuritiesDebtMaturitiesAfterTenYearsAmortizedCost": "Amortized cost of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), with single maturity date and allocated without single maturity date, maturing after tenth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "AvailableForSaleSecuritiesDebtMaturitiesAfterTenYearsFairValue": "Fair value of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), with single maturity date and allocated without single maturity date, maturing after tenth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "AvailableForSaleSecuritiesDebtMaturitiesSingleMaturityDate": "Fair value of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), with single maturity date and allocated without single maturity date.",
 "AvailableForSaleSecuritiesDebtMaturitiesSingleMaturityDateAmortizedCostBasis": "Amortized cost of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), with single maturity date and allocated without single maturity date.",
 "AvailableForSaleSecuritiesDebtMaturitiesWithinOneYearAmortizedCost": "Amortized cost of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), with single maturity date and allocated without single maturity date, maturing in next fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "AvailableForSaleSecuritiesDebtMaturitiesWithinOneYearFairValue": "Fair value of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), with single maturity date and allocated without single maturity date, maturing in next fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "AvailableForSaleSecuritiesDebtSecurities": "Amount of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale).",
 "AvailableForSaleSecuritiesGrossRealizedGains": "This item represents the gross profit realized on the sale of debt or equity securities categorized neither as held-to-maturity nor trading securities.",
 "AvailableForSaleSecuritiesGrossRealizedLosses": "This item represents the gross loss realized on the sale of debt or equity securities categorized neither as held-to-maturity nor trading securities.",
 "BusinessAcquisitionCostOfAcquiredEntityCashPaid": "Amount of cash paid to acquire the entity.",
 "BusinessAcquisitionCostOfAcquiredEntityEquityInterestsIssuedAndIssuable": "The acquisition-date fair value of the equity interests of the acquirer, including the number of instruments or interests issued or issuable in consideration for the business combination.",
 "BusinessAcquisitionCostOfAcquiredEntityOtherNoncashConsideration": "Fair value of noncash consideration given by the acquirer to acquire the entity. Does not include cash paid, the fair value of debt and securities issued and liabilities incurred to acquire the entity.",
 "BusinessAcquisitionCostOfAcquiredEntityPurchasePrice": "The total cost of the acquired entity including the cash paid to shareholders of acquired entities, fair value of debt and equity securities issued to shareholders of acquired entities, the fair value of the liabilities assumed, and direct costs of the acquisition.",
 "BusinessAcquisitionPurchasePriceAllocationAmortizableIntangibleAssets": "The amount of acquisition cost of a business combination allocated to an identifiable intangible asset that will be amortized.",
 "BusinessAcquisitionPurchasePriceAllocationAssetsAcquiredLiabilitiesAssumedNet": "The total purchase price of the acquired entity. This includes cash paid to equity interest holders of the acquired entity, fair value of debt and equity securities issued to equity holders of the acquired entity, and transaction costs paid to third parties to consummate the acquisition.",
 "BusinessAcquisitionPurchasePriceAllocationCurrentLiabilitiesAccountsPayable": "The amount of acquisition cost of a business combination allocated to accounts payable of the acquired entity.",
 "BusinessAcquisitionPurchasePriceAllocationGoodwillAmount": "Amount of goodwill arising from a business combination, which is the excess of the cost of the acquired entity over the amounts assigned to assets acquired and liabilities assumed.",
 "BusinessAcquisitionPurchasePriceAllocationNoncurrentLiabilitiesLongTermDebt": "The amount of acquisition cost of a business combination allocated to the noncurrent portion of the long-term debt assumed from the acquired entity.",
 "BusinessAcquisitionPurchasePriceAllocationOtherNoncurrentAssets": "Amount of acquisition cost of a business combination allocated to other noncurrent assets not separately disclosed.",
 "BusinessAcquisitionPurchasePriceAllocationOtherNoncurrentLiabilities": "Amount of acquisition cost of a business combination allocated to other noncurrent liabilities not separately disclosed.",
 "BusinessAcquisitionPurchasePriceAllocationPropertyPlantAndEquipment": "The amount of acquisition cost of a business combination allocated to property, plant and equipment to be used in ongoing operations.",
 "BusinessAcquisitionsProFormaNetIncomeLoss": "The pro forma net Income or Loss for the period as if the business combination or combinations had been completed at the beginning of a period.",
 "BusinessAcquisitionsProFormaRevenue": "The pro forma revenue for a period as if the business combination or combinations had been completed at the beginning of the period.",
 "BusinessCombinationConsiderationTransferred1": "Amount of consideration transferred, consisting of acquisition-date fair value of assets transferred by the acquirer, liabilities incurred by the acquirer, and equity interest issued by the acquirer.",
 "BusinessCombinationConsiderationTransferredLiabilitiesIncurred": "Amount of liabilities incurred by the acquirer as part of consideration transferred in a business combination.",
 "BusinessCombinationConsiderationTransferredOther1": "Amount of tangible or intangible assets, including a business or subsidiary of the acquirer transferred by the entity to the former owners of the acquiree. Excludes cash.",
 "BusinessCombinationProFormaInformationEarningsOrLossOfAcquireeSinceAcquisitionDateActual": "This element represents the amount of earnings or loss of the acquiree since the acquisition date included in the consolidated income statement for the reporting period.",
 "BusinessCombinationProFormaInformationRevenueOfAcquireeSinceAcquisitionDateActual": "This element represents the amount of revenue of the acquiree since the acquisition date included in the consolidated income statement for the reporting period.",
 "BusinessCombinationRecognizedIdentifiableAssetsAcquiredAndLiabilitiesAssumedDeferredTaxAssetsNoncurrent": "Amount, after allocation of valuation allowance, of deferred tax asset attributable to deductible temporary differences and carryforwards acquired at the acquisition date, classified as noncurrent.",
 "BusinessCombinationRecognizedIdentifiableAssetsAcquiredAndLiabilitiesAssumedDeferredTaxLiabilitiesNoncurrent": "Amount of deferred tax liability attributable to taxable temporary difference assumed at the acquisition date that are classified as noncurrent.",
 "BusinessCombinationRecognizedIdentifiableAssetsAcquiredAndLiabilitiesAssumedIntangibles": "The amount of identifiable intangible assets recognized as of the acquisition date.",
 "BusinessCombinationRecognizedIdentifiableAssetsAcquiredAndLiabilitiesAssumedNet": "Amount recognized as of the acquisition date for the identifiable assets acquired in excess of (less than) the aggregate liabilities assumed.",
 "BusinessCombinationRecognizedIdentifiableAssetsAcquiredAndLiabilitiesAssumedNoncurrentLiabilitiesOther": "Amount of other liabilities due after one year or the normal operating cycle, if longer, assumed at the acquisition date.",
 "BusinessCombinationRecognizedIdentifiableAssetsAcquiredAndLiabilitiesAssumedOtherNoncurrentAssets": "Amount of other assets expected to be realized or consumed after one year or the normal operating cycle, if longer, acquired at the acquisition date.",
 "BusinessCombinationRecognizedIdentifiableAssetsAcquiredAndLiabilitiesAssumedPropertyPlantAndEquipment": "The amount of property, plant, and equipment recognized as of the acquisition date.",
 "CapitalizedComputerSoftwareAdditions": "Additions made to capitalized computer software costs during the period.",
 "CapitalizedComputerSoftwareAmortization": "For each income statement presented, the amount charged to expense for amortization of capitalized computer software costs.",
 "CapitalizedComputerSoftwareAmortization1": "Amount of expense for amortization of capitalized computer software costs.",
 "CapitalizedComputerSoftwareGross": "Amount before accumulated amortization of capitalized costs for computer software, including but not limited to, acquired and internally developed computer software.",
 "CapitalizedComputerSoftwarePeriodIncreaseDecrease": "Amount of increase (decrease) in capitalized computer software costs.",
 "CapitalLeasedAssetsGross": "Amount before accumulated depreciation of leased physical assets used in the normal conduct of business to produce goods and services.",
 "CapitalLeaseObligations": "Amount equal to the present value (the principal) at the beginning of the lease term of minimum lease payments during the lease term (excluding that portion of the payments representing executory costs such as insurance, maintenance, and taxes to be paid by the lessor, together with any profit thereon) net of payments or other amounts applied to the principal through the balance sheet date.",
 "CapitalLeaseObligationsCurrent": "Amount of capital lease obligation due within one year or the normal operating cycle, if longer.",
 "CapitalLeaseObligationsIncurred": "Amount of increase in lease obligation from new lease.",
 "CapitalLeaseObligationsNoncurrent": "Amount equal to the present value (the principal) at the beginning of the lease term of minimum lease payments during the lease term (excluding that portion of the payments representing executory costs such as insurance, maintenance, and taxes to be paid by the lessor, together with any profit thereon) net of payments or other amounts applied to the principal, through the balance sheet date and due to be paid more than one year (or one operating cycle, if longer) after the balance sheet date.",
 "CapitalLeasesFutureMinimumPaymentsDue": "Amount of minimum lease payments for capital leases.",
 "CapitalLeasesFutureMinimumPaymentsDueCurrent": "Amount of minimum lease payments for capital leases due in the next fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date.",
 "CapitalLeasesFutureMinimumPaymentsDueInFiveYears": "Amount of minimum lease payments for capital leases due in the fifth fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date.",
 "CapitalLeasesFutureMinimumPaymentsDueInFourYears": "Amount of minimum lease payments for capital leases due in the fourth fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date.",
 "CapitalLeasesFutureMinimumPaymentsDueInThreeYears": "Amount of minimum lease payments for capital leases due in the third fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date.",
 "CapitalLeasesFutureMinimumPaymentsDueInTwoYears": "Amount of minimum lease payments for capital leases due in the second fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date.",
 "CapitalLeasesFutureMinimumPaymentsDueThereafter": "Amount of minimum lease payments for capital leases due after the fifth fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date.",
 "CapitalLeasesFutureMinimumPaymentsInterestIncludedInPayments": "Amount necessary to reduce net minimum lease payments to present value for capital leases.",
 "CapitalLeasesFutureMinimumPaymentsNetMinimumPayments1": "Amount of minimum lease payments for capital leases net of executory costs, which include amounts paid by the lessee to the lessor for insurance, maintenance and taxes.",
 "CapitalLeasesFutureMinimumPaymentsPresentValueOfNetMinimumPayments": "Present value of minimum lease payments for capital leases net of executory costs, including amounts paid by the lessee to the lessor for insurance, maintenance and taxes.",
 "CapitalLeasesFutureMinimumPaymentsRemainderOfFiscalYear": "Amount of minimum lease payments for capital leases due in the remainder of the fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date.",
 "CapitalLeasesIncomeStatementAmortizationExpense": "The charge for the use of long-lived depreciable capital leased assets for the period.",
 "CapitalLeasesLesseeBalanceSheetAssetsByMajorClassAccumulatedDeprecation": "The total charge for the use of long-lived depreciable assets subject to a lease meeting the criteria for capitalization.",
 "CashAndCashEquivalentsAtCarryingValue": "Amount of currency on hand as well as demand deposits with banks or financial institutions. Includes other kinds of accounts that have the general characteristics of demand deposits. Also includes short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates. Excludes cash and cash equivalents within disposal group and discontinued operation.",
 "CashAndCashEquivalentsPeriodIncreaseDecrease": "Amount of increase (decrease) in cash and cash equivalents. Cash and cash equivalents are the amount of currency on hand as well as demand deposits with banks or financial institutions. Includes other kinds of accounts that have the general characteristics of demand deposits. Also includes short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates. Includes effect from exchange rate changes.",
 "CashCashEquivalentsAndShortTermInvestments": "Cash includes currency on hand as well as demand deposits with banks or financial institutions. It also includes other kinds of accounts that have the general characteristics of demand deposits in that the customer may deposit additional funds at any time and effectively may withdraw funds at any time without prior notice or penalty. Cash equivalents, excluding items classified as marketable securities, include short-term, highly liquid Investments that are both readily convertible to known amounts of cash, and so near their maturity that they present minimal risk of changes in value because of changes in interest rates. Generally, only investments with original maturities of three months or less qualify under that definition. Original maturity means original maturity to the entity holding the investment. For example, both a three-month US Treasury bill and a three-year Treasury note purchased three months from maturity qualify as cash equivalents. However, a Treasury note purchased three years ago does not become a cash equivalent when its remaining maturity is three months. Short-term investments, exclusive of cash equivalents, generally consist of marketable securities intended to be sold within one year (or the normal operating cycle if longer) and may include trading securities, available-for-sale securities, or held-to-maturity securities (if maturing within one year), as applicable.",
 "CashCashEquivalentsRestrictedCashAndRestrictedCashEquivalents": "Amount of cash and cash equivalents, and cash and cash equivalents restricted to withdrawal or usage. Excludes amount for disposal group and discontinued operations. Cash includes, but is not limited to, currency on hand, demand deposits with banks or financial institutions, and other accounts with general characteristics of demand deposits. Cash equivalents include, but are not limited to, short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates.",
 "CashCashEquivalentsRestrictedCashAndRestrictedCashEquivalentsPeriodIncreaseDecreaseIncludingExchangeRateEffect": "Amount of increase (decrease) in cash, cash equivalents, and cash and cash equivalents restricted to withdrawal or usage; including effect from exchange rate change. Cash includes, but is not limited to, currency on hand, demand deposits with banks or financial institutions, and other accounts with general characteristics of demand deposits. Cash equivalents include, but are not limited to, short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates.",
 "CommitmentsAndContingencies": "Represents the caption on the face of the balance sheet to indicate that the entity has entered into (1) purchase or supply arrangements that will require expending a portion of its resources to meet the terms thereof, and (2) is exposed to potential losses or, less frequently, gains, arising from (a) possible claims against a company's resources due to future performance under contract terms, and (b) possible losses or likely gains from uncertainties that will ultimately be resolved when one or more future events that are deemed likely to occur do occur or fail to occur.",
 "CommitmentsFairValueDisclosure": "Fair value portion of arrangements with third parties, including, but not limited to, operating lease arrangement and arrangement in which the entity has agreed to expend funds to procure goods or services, or has agreed to commit resources to supply goods or services.",
 "CommonStockCapitalSharesReservedForFutureIssuance": "Aggregate number of common shares reserved for future issuance.",
 "CommonStockParOrStatedValuePerShare": "Face amount or stated value per share of common stock.",
 "CommonStockSharesAuthorized": "The maximum number of common shares permitted to be issued by an entity's charter and bylaws.",
 "CommonStockSharesIssued": "Total number of common shares of an entity that have been sold or granted to shareholders (includes common shares that were issued, repurchased and remain in the treasury). These shares represent capital invested by the firm's shareholders and owners, and may be all or only a portion of the number of shares authorized. Shares issued include shares outstanding and shares held in the treasury.",
 "CommonStockSharesOutstanding": "Number of shares of common stock outstanding. Common stock represent the ownership interest in a corporation.",
 "CommonStockValue": "Aggregate par or stated value of issued nonredeemable common stock (or common stock redeemable solely at the option of the issuer). This item includes treasury stock repurchased by the entity. Note: elements for number of nonredeemable common shares, par value and other disclosure concepts are in another section within stockholders' equity.",
 "ComprehensiveIncomeNetOfTax": "Amount after tax of increase (decrease) in equity from transactions and other events and circumstances from net income and other comprehensive income, attributable to parent entity. Excludes changes in equity resulting from investments by owners and distributions to owners.",
 "ConstructionLoanNoncurrent": "This element represents the noncurrent portion of a long-term real estate loan to finance building costs. The funds are disbursed as needed or in accordance with a prearranged plan; generally, a portion of the funds is disbursed at inception and the remainder as construction progresses. The money is repaid on completion of the project (generally one to seven years), usually from the proceeds of a mortgage loan. The rate is normally higher than the prime rate, and there is usually an origination fee. The effective yield on these loans tends to be high, and the lender has a security interest in the real property.",
 "ContractualObligation": "Amount of contractual obligation, including but not limited to, long-term debt, capital lease obligations, operating lease obligations, purchase obligations, and other commitments.",
 "ContractualObligationDueAfterFifthYear": "Amount of contractual obligation to be paid after fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "ContractualObligationDueInFifthYear": "Amount of contractual obligation to be paid in fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "ContractualObligationDueInFourthYear": "Amount of contractual obligation to be paid in fourth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "ContractualObligationDueInNextTwelveMonths": "Amount of contractual obligation to be paid in next fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "ContractualObligationDueInSecondYear": "Amount of contractual obligation to be paid in second fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "ContractualObligationDueInThirdYear": "Amount of contractual obligation to be paid in third fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "ContractualObligationFutureMinimumPaymentsDueRemainderOfFiscalYear": "Amount of contractual obligation to be paid in remainder of current fiscal year.",
 "ContractWithCustomerLiability": "Amount of obligation to transfer good or service to customer for which consideration has been received or is receivable.",
 "ContractWithCustomerLiabilityCurrent": "Amount of obligation to transfer good or service to customer for which consideration has been received or is receivable, classified as current.",
 "ContractWithCustomerLiabilityNoncurrent": "Amount of obligation to transfer good or service to customer for which consideration has been received or is receivable, classified as noncurrent.",
 "ContractWithCustomerLiabilityRevenueRecognized": "Amount of revenue recognized that was previously included in balance of obligation to transfer good or service to customer for which consideration from customer has been received or is due.",
 "ContractWithCustomerRefundLiability": "Amount of liability for consideration received or receivable from customer which is not included in transaction price, when consideration is expected to be refunded to customer.",
 "ContractWithCustomerRightToRecoverProduct": "Amount of right to recover product from customer on settling refund liability.",
 "CostOfGoodsAndServicesSold": "The aggregate costs related to goods produced and sold and services rendered by an entity during the reporting period. This excludes costs incurred during the reporting period related to financial services rendered and other revenue generating activities.",
 "CostsAndExpenses": "Total costs of sales and operating expenses for the period.",
 "CumulativeEffectOfInitialAdoptionOfNewAccountingPrinciple": "Cumulative effect of initial adoption of new accounting principle on beginning retained earnings, net of tax. This element can be used, generally, for the adjustment to retained earnings of a new accounting principle.",
 "CumulativeEffectOfNewAccountingPrincipleInPeriodOfAdoption": "Amount after tax of increase (decrease) to equity or (increase) decrease to net assets, resulting from the cumulative effect adjustment of a new accounting principle applied in the period of adoption.",
 "CurrentFederalTaxExpenseBenefit": "Amount of current federal tax expense (benefit) pertaining to income (loss) from continuing operations.",
 "CurrentForeignTaxExpenseBenefit": "Amount of current foreign income tax expense (benefit) pertaining to income (loss) from continuing operations.",
 "CurrentIncomeTaxExpenseBenefit": "Amount of current income tax expense (benefit) pertaining to taxable income (loss) from continuing operations.",
 "CurrentStateAndLocalTaxExpenseBenefit": "Amount of current state and local tax expense (benefit) pertaining to income (loss) from continuing operations.",
 "DebtInstrumentBasisSpreadOnVariableRate1": "Percentage points added to the reference rate to compute the variable rate on the debt instrument.",
 "DebtInstrumentCarryingAmount": "Amount, before unamortized (discount) premium and debt issuance costs, of long-term debt. Includes, but is not limited to, notes payable, bonds payable, commercial loans, mortgage loans, convertible debt, subordinated debt and other types of debt.",
 "DebtInstrumentUnamortizedDiscount": "Amount, after accumulated amortization, of debt discount.",
 "DebtInstrumentUnamortizedDiscountPremiumAndDebtIssuanceCostsNet": "Amount of unamortized debt discount (premium) and debt issuance costs.",
 "DebtSecuritiesAvailableForSaleRealizedGain": "Amount of realized gain on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale).",
 "DebtSecuritiesAvailableForSaleRealizedLoss": "Amount of realized loss on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale).",
 "DeferredFederalIncomeTaxExpenseBenefit": "Amount of deferred federal income tax expense (benefit) pertaining to income (loss) from continuing operations.",
 "DeferredForeignIncomeTaxExpenseBenefit": "Amount of deferred foreign income tax expense (benefit) pertaining to income (loss) from continuing operations.",
 "DeferredIncomeTaxExpenseBenefit": "Amount of deferred income tax expense (benefit) pertaining to income (loss) from continuing operations.",
 "DeferredIncomeTaxLiabilitiesNet": "Amount, after deferred tax asset, of deferred tax liability attributable to taxable differences with jurisdictional netting.",
 "DeferredRevenue": "Amount of deferred income and obligation to transfer product and service to customer for which consideration has been received or is receivable.",
 "DeferredRevenueCurrent": "Amount of deferred income and obligation to transfer product and service to customer for which consideration has been received or is receivable, classified as current.",
 "DeferredRevenueNoncurrent": "Amount of deferred income and obligation to transfer product and service to customer for which consideration has been received or is receivable, classified as noncurrent.",
 "DeferredRevenueRevenueRecognized1": "Amount of revenue recognized that was previously reported as deferred or unearned revenue.",
 "DeferredStateAndLocalIncomeTaxExpenseBenefit": "Amount of deferred state and local tax expense (benefit) pertaining to income (loss) from continuing operations.",
 "DeferredTaxAssetsDeferredIncome": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences from deferred income.",
 "DeferredTaxAssetsGross": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences and carryforwards.",
 "DeferredTaxAssetsGrossCurrent": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences and carryforwards classified as current.",
 "DeferredTaxAssetsInvestments": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences from investments (excludes investments in subsidiaries and equity method investments).",
 "DeferredTaxAssetsLiabilitiesNet": "Amount, after allocation of valuation allowances and deferred tax liability, of deferred tax asset attributable to deductible differences and carryforwards, without jurisdictional netting.",
 "DeferredTaxAssetsNet": "Amount after allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences and carryforwards.",
 "DeferredTaxAssetsNetCurrent": "Amount after allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences and carryforwards classified as current.",
 "DeferredTaxAssetsNetNoncurrent": "Amount after allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences and carryforwards classified as noncurrent.",
 "DeferredTaxAssetsOperatingLossCarryforwards": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible operating loss carryforwards.",
 "DeferredTaxAssetsOperatingLossCarryforwardsDomestic": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible domestic operating loss carryforwards. Excludes state and local operating loss carryforwards.",
 "DeferredTaxAssetsOperatingLossCarryforwardsForeign": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible foreign operating loss carryforwards.",
 "DeferredTaxAssetsOther": "Amount, before allocation of valuation allowance, of deferred tax asset attributable to deductible temporary differences, classified as other.",
 "DeferredTaxAssetsPropertyPlantAndEquipment": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences from property, plant, and equipment.",
 "DeferredTaxAssetsTaxCreditCarryforwards": "Amount, before allocation of a valuation allowances, of deferred tax assets attributable to deductible tax credit carryforwards including, but not limited to, research, foreign, general business, alternative minimum tax, and other deductible tax credit carryforwards.",
 "DeferredTaxAssetsTaxDeferredExpense": "Amount, before allocation of valuation allowances, of deferred tax asset attributable to deductible differences from reserves and accruals, compensation and benefit costs, and other provisions, reserves, and allowances.",
 "DeferredTaxAssetsTaxDeferredExpenseCompensationAndBenefitsShareBasedCompensationCost": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences from share-based compensation.",
 "DeferredTaxAssetsTaxDeferredExpenseReservesAndAccruals": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences from reserves and accruals.",
 "DeferredTaxAssetsValuationAllowance": "Amount of deferred tax assets for which it is more likely than not that a tax benefit will not be realized.",
 "DeferredTaxLiabilities": "Amount, after deferred tax asset, of deferred tax liability attributable to taxable differences without jurisdictional netting.",
 "DeferredTaxLiabilitiesCurrent": "Amount, after deferred tax asset, of deferred tax liability attributable to taxable differences, with jurisdictional netting and classified as current.",
 "DeferredTaxLiabilitiesDeferredExpense": "Amount of deferred tax liability attributable to taxable temporary differences from capitalized costs.",
 "DeferredTaxLiabilitiesGoodwillAndIntangibleAssetsIntangibleAssets": "Amount of deferred tax liability attributable to taxable temporary differences from intangible assets other than goodwill.",
 "DeferredTaxLiabilitiesNoncurrent": "Amount, after deferred tax asset, of deferred tax liability attributable to taxable differences, with jurisdictional netting and classified as noncurrent.",
 "DeferredTaxLiabilitiesOther": "Amount of deferred tax liability attributable to taxable temporary differences classified as other.",
 "DeferredTaxLiabilitiesPropertyPlantAndEquipment": "Amount of deferred tax liability attributable to taxable temporary differences from property, plant, and equipment.",
 "Depreciation": "The amount of expense recognized in the current period that reflects the allocation of the cost of tangible assets over the assets' useful lives. Includes production and non-production related depreciation.",
 "DepreciationAndAmortization": "The current period expense charged against earnings on long-lived, physical assets not used in production, and which are not intended for resale, to allocate or recognize the cost of such assets over their useful lives; or to record the reduction in book value of an intangible asset over the benefit period of such asset; or to reflect consumption during the period of an asset that is not used in production.",
 "DepreciationDepletionAndAmortization": "The aggregate expense recognized in the current period that allocates the cost of tangible assets, intangible assets, or depleting assets to periods that benefit from use of the assets.",
 "EarningsPerShareBasic": "The amount of net income (loss) for the period per each share of common stock or unit outstanding during the reporting period.",
 "EarningsPerShareDiluted": "The amount of net income (loss) for the period available to each share of common stock or common unit outstanding during the reporting period and to each share or unit that would have been outstanding assuming the issuance of common shares or units for all dilutive potential common shares or units outstanding during the reporting period.",
 "EffectiveIncomeTaxRateContinuingOperations": "Percentage of current income tax expense (benefit) and deferred income tax expense (benefit) pertaining to continuing operations.",
 "EffectiveIncomeTaxRateReconciliationAtFederalStatutoryIncomeTaxRate": "Percentage of domestic federal statutory tax rate applicable to pretax income (loss).",
 "EffectiveIncomeTaxRateReconciliationChangeInDeferredTaxAssetsValuationAllowance": "Percentage of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to changes in the valuation allowance for deferred tax assets.",
 "EffectiveIncomeTaxRateReconciliationDeductionsQualifiedProductionActivities": "Percentage of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to deduction for qualified production activity.",
 "EffectiveIncomeTaxRateReconciliationForeignIncomeTaxRateDifferential": "Percentage of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations applicable to statutory income tax expense (benefit) outside of the country of domicile.",
 "EffectiveIncomeTaxRateReconciliationNondeductibleExpenseShareBasedCompensationCost": "Percentage of difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying domestic federal statutory income tax rate to pretax income (loss) from continuing operation, attributable to nondeductible expense for share-based payment arrangement.",
 "EffectiveIncomeTaxRateReconciliationOtherAdjustments": "Percentage of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to other adjustments.",
 "EffectiveIncomeTaxRateReconciliationShareBasedCompensationExcessTaxBenefitAmount": "Amount of difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying domestic federal statutory income tax rate to pretax income (loss) from continuing operation, attributable to expense for award under share-based payment arrangement. Excludes expense determined to be nondeductible upon grant or after for award under share-based payment arrangement.",
 "EffectiveIncomeTaxRateReconciliationStateAndLocalIncomeTaxes": "Percentage of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations applicable to state and local income tax expense (benefit), net of federal tax expense (benefit).",
 "EffectiveIncomeTaxRateReconciliationTaxCredits": "Percentage of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to tax credits. Including, but not limited to, research credit, foreign tax credit, investment tax credit, and other tax credits.",
 "EffectiveIncomeTaxRateReconciliationTaxCutsAndJobsActOf2017Amount": "Amount of reported income tax expense (benefit) in excess of (less than) expected income tax expense (benefit) computed by applying domestic federal statutory income tax rate to pretax income (loss) from continuing operations, attributable to Tax Cuts and Jobs Act.",
 "EffectiveIncomeTaxRateReconciliationTaxCutsAndJobsActOf2017TransitionTaxOnAccumulatedForeignEarningsAmount": "Amount of reported income tax expense (benefit) in excess of (less than) expected income tax expense (benefit) computed by applying domestic federal statutory income tax rate to pretax income (loss) from continuing operations, attributable to increase (decrease) from transition tax on accumulated earnings of controlled foreign corporation deemed repatriated pursuant to Tax Cuts and Jobs Act.",
 "EffectOfExchangeRateOnCashAndCashEquivalents": "Amount of increase (decrease) from the effect of exchange rate changes on cash and cash equivalent balances held in foreign currencies.",
 "EmployeeRelatedLiabilitiesCurrentAndNoncurrent": "Total of the carrying values as of the balance sheet date of obligations incurred through that date and payable for obligations related to services received from employees, such as accrued salaries and bonuses, payroll taxes and fringe benefits.",
 "EmployeeServiceShareBasedCompensationAllocationOfRecognizedPeriodCostsCapitalizedAmount": "Amount of cost capitalized for award under share-based payment arrangement.",
 "EmployeeServiceShareBasedCompensationNonvestedAwardsTotalCompensationCostNotYetRecognized": "Amount of cost not yet recognized for nonvested award under share-based payment arrangement.",
 "EmployeeServiceShareBasedCompensationNonvestedAwardsTotalCompensationCostNotYetRecognizedPeriodForRecognition": "The weighted average period over which unrecognized compensation is expected to be recognized for equity-based compensation plans, using a decimal to express in number of years.",
 "EmployeeServiceShareBasedCompensationNonvestedAwardsTotalCompensationCostNotYetRecognizedStockOptions": "Amount of cost to be recognized for option under share-based payment arrangement.",
 "EmployeeServiceShareBasedCompensationTaxBenefitFromCompensationExpense": "Amount of tax benefit for recognition of expense of award under share-based payment arrangement.",
 "EmployeeServiceShareBasedCompensationUnrecognizedCompensationCostsOnNonvestedAwards": "As of the latest balance sheet date presented, the total compensation cost related to outstanding, nonvested equity-based compensation awards not yet recognized (will be charged against earnings as services are performed or other vesting criteria are met).",
 "EquityMethodInvestmentOwnershipPercentage": "The percentage of ownership of common stock or equity participation in the investee accounted for under the equity method of accounting.",
 "EquityMethodInvestmentRealizedGainLossOnDisposal": "Amount of gain (loss) on sale or disposal of an equity method investment.",
 "EquityMethodInvestmentSoldCarryingAmount": "Amount of the entity's equity method investment which has been sold.",
 "EquityMethodInvestmentSummarizedFinancialInformationCurrentAssets": "The amount of current assets reported by an equity method investment of the entity.",
 "EquityMethodInvestmentSummarizedFinancialInformationCurrentLiabilities": "The amount of current liabilities reported by an equity method investment of the entity.",
 "EquityMethodInvestmentSummarizedFinancialInformationGrossProfitLoss": "The amount of gross profit (loss) reported by an equity method investment of the entity.",
 "EquityMethodInvestmentSummarizedFinancialInformationIncomeLossFromContinuingOperationsBeforeExtraordinaryItems": "Amount of income (loss) from continuing operations reported by an equity method investee.",
 "EquityMethodInvestmentSummarizedFinancialInformationNetIncomeLoss": "The amount of net income (loss) reported by an equity method investment of the entity.",
 "EquityMethodInvestmentSummarizedFinancialInformationNoncurrentAssets": "The amount of noncurrent assets reported by an equity method investment of the entity.",
 "EquityMethodInvestmentSummarizedFinancialInformationNoncurrentLiabilities": "The amount of noncurrent liabilities reported by an equity method investment of the entity.",
 "EquityMethodInvestmentSummarizedFinancialInformationRedeemablePreferredStock": "The amount of redeemable preferred stock reported by an equity method investment of the entity.",
 "EquityMethodInvestmentSummarizedFinancialInformationRevenue": "Amount of revenue from sale of product and rendering of service reported by equity method investee.",
 "EquityMethodInvestments": "This item represents the carrying amount on the entity's balance sheet of its investment in common stock of an equity method investee. This is not an indicator of the fair value of the investment, rather it is the initial cost adjusted for the entity's share of earnings and losses of the investee, adjusted for any distributions (dividends) and other than temporary impairment (OTTI) losses recognized.",
 "EquitySecuritiesFvNiGainLoss": "Amount of unrealized and realized gain (loss) on investment in equity security measured at fair value with change in fair value recognized in net income (FV-NI).",
 "EquitySecuritiesFvNiUnrealizedGainLoss": "Amount of unrealized gain (loss) on investment in equity security measured at fair value with change in fair value recognized in net income (FV-NI).",
 "EquitySecuritiesWithoutReadilyDeterminableFairValueAmount": "Amount of investment in equity security without readily determinable fair value.",
 "EquitySecuritiesWithoutReadilyDeterminableFairValueUpwardPriceAdjustmentAnnualAmount": "Amount of gain from upward price adjustment on investment in equity security without readily determinable fair value.",
 "ExcessTaxBenefitFromShareBasedCompensationFinancingActivities": "Amount of cash inflow from realized tax benefit related to deductible compensation cost reported on the entity's tax return for equity instruments in excess of the compensation cost for those instruments recognized for financial reporting purposes.",
 "ExcessTaxBenefitFromShareBasedCompensationOperatingActivities": "Amount of cash outflow for realized tax benefit related to deductible compensation cost reported on the entity's tax return for equity instruments in excess of the compensation cost for those instruments recognized for financial reporting purposes.",
 "FairValueAdjustmentOfWarrants": "Amount of expense (income) related to adjustment to fair value of warrant liability.",
 "FinanceLeaseInterestExpense": "Amount of interest expense on finance lease liability.",
 "FinanceLeaseInterestPaymentOnLiability": "Amount of interest paid on finance lease liability.",
 "FinanceLeaseLiability": "Present value of lessee's discounted obligation for lease payments from finance lease.",
 "FinanceLeaseLiabilityCurrent": "Present value of lessee's discounted obligation for lease payments from finance lease, classified as current.",
 "FinanceLeaseLiabilityNoncurrent": "Present value of lessee's discounted obligation for lease payments from finance lease, classified as noncurrent.",
 "FinanceLeaseLiabilityPaymentsDue": "Amount of lessee's undiscounted obligation for lease payments for finance lease.",
 "FinanceLeaseLiabilityPaymentsDueAfterYearFive": "Amount of lessee's undiscounted obligation for lease payment for finance lease to be paid after fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "FinanceLeaseLiabilityPaymentsDueNextTwelveMonths": "Amount of lessee's undiscounted obligation for lease payment for finance lease to be paid in next fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "FinanceLeaseLiabilityPaymentsDueYearFive": "Amount of lessee's undiscounted obligation for lease payment for finance lease to be paid in fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "FinanceLeaseLiabilityPaymentsDueYearFour": "Amount of lessee's undiscounted obligation for lease payment for finance lease to be paid in fourth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "FinanceLeaseLiabilityPaymentsDueYearThree": "Amount of lessee's undiscounted obligation for lease payment for finance lease to be paid in third fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "FinanceLeaseLiabilityPaymentsDueYearTwo": "Amount of lessee's undiscounted obligation for lease payment for finance lease to be paid in second fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "FinanceLeaseLiabilityPaymentsRemainderOfFiscalYear": "Amount of lessee's undiscounted obligation for lease payment for finance lease to be paid in remainder of current fiscal year.",
 "FinanceLeaseLiabilityUndiscountedExcessAmount": "Amount of lessee's undiscounted obligation for lease payments in excess of discounted obligation for lease payments for finance lease.",
 "FinanceLeasePrincipalPayments": "Amount of cash outflow for principal payment on finance lease.",
 "FinanceLeaseRightOfUseAsset": "Amount, after accumulated amortization, of right-of-use asset from finance lease.",
 "FinanceLeaseRightOfUseAssetAccumulatedAmortization": "Amount of accumulated amortization of right-of-use asset from finance lease.",
 "FinanceLeaseRightOfUseAssetAmortization": "Amount of amortization expense attributable to right-of-use asset from finance lease.",
 "FinanceLeaseRightOfUseAssetBeforeAccumulatedAmortization": "Amount, before accumulated amortization, of right-of-use asset from finance lease.",
 "FinanceLeaseWeightedAverageDiscountRatePercent": "Weighted average discount rate for finance lease calculated at point in time.",
 "FiniteLivedIntangibleAssetsAccumulatedAmortization": "Accumulated amount of amortization of assets, excluding financial assets and goodwill, lacking physical substance with a finite life.",
 "FiniteLivedIntangibleAssetsAmortizationExpenseAfterYearFive": "Amount of amortization for asset, excluding financial asset and goodwill, lacking physical substance with finite life expected to be recognized after fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "FiniteLivedIntangibleAssetsAmortizationExpenseNextTwelveMonths": "Amount of amortization for assets, excluding financial assets and goodwill, lacking physical substance with finite life expected to be recognized in next fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "FiniteLivedIntangibleAssetsAmortizationExpenseYearFive": "Amount of amortization for assets, excluding financial assets and goodwill, lacking physical substance with finite life expected to be recognized in fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "FiniteLivedIntangibleAssetsAmortizationExpenseYearFour": "Amount of amortization for assets, excluding financial assets and goodwill, lacking physical substance with finite life expected to be recognized in fourth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "FiniteLivedIntangibleAssetsAmortizationExpenseYearThree": "Amount of amortization for assets, excluding financial assets and goodwill, lacking physical substance with finite life expected to be recognized in third fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "FiniteLivedIntangibleAssetsAmortizationExpenseYearTwo": "Amount of amortization for assets, excluding financial assets and goodwill, lacking physical substance with finite life expected to be recognized in second fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "FiniteLivedIntangibleAssetsFutureAmortizationExpense": "The aggregate estimated amortization expense for succeeding fiscal years for intangible assets subject to amortization.",
 "FiniteLivedIntangibleAssetsGross": "Amount before amortization of assets, excluding financial assets and goodwill, lacking physical substance with a finite life.",
 "FiniteLivedIntangibleAssetsNet": "Amount after amortization of assets, excluding financial assets and goodwill, lacking physical substance with a finite life.",
 "FiniteLivedIntangibleAssetsUsefulLifeMaximum": "The maximum useful life of a major finite-lived intangible asset class. A major class is composed of intangible assets that can be grouped together because they are similar either by their nature or by their use in the operations of a company.",
 "FiniteLivedIntangibleAssetsUsefulLifeMinimum": "The minimum useful life of a major finite-lived intangible asset class. A major class is composed of intangible assets that can be grouped together because they are similar either by their nature or by their use in the operations of a company.",
 "FiniteLivedIntangibleAssetsWeightedAverageUsefulLife": "The calculated weighted-average useful life of all finite-lived intangible assets.",
 "ForeignCurrencyTransactionGainLossBeforeTax": "Amount before tax of foreign currency transaction realized and unrealized gain (loss) recognized in the income statement.",
 "ForeignCurrencyTransactionGainLossRealized": "Amount before tax of foreign currency transaction realized gain (loss) recognized in the income statement.",
 "FutureAmortizationExpenseYearFive": "The amount of amortization expense expected to be recognized during year five of the five succeeding fiscal years.",
 "FutureAmortizationExpenseYearFour": "The amount of amortization expense expected to be recognized during year four of the five succeeding fiscal years.",
 "FutureAmortizationExpenseYearOne": "The amount of amortization expense expected to be recognized during year one of the five succeeding fiscal years.",
 "FutureAmortizationExpenseYearThree": "The amount of amortization expense expected to be recognized during year three of the five succeeding fiscal years.",
 "FutureAmortizationExpenseYearTwo": "The amount of amortization expense expected to be recognized during year two of the five succeeding fiscal years.",
 "GainLossOnDispositionOfAssets": "Amount of gain (loss) on sale or disposal of property, plant and equipment assets, excluding oil and gas property and timber property.",
 "GainLossOnSaleOfInvestments": "The net realized gain (loss) on investments sold during the period, not including gains (losses) on securities separately or otherwise categorized as trading, available-for-sale, or held-to-maturity, which, for cash flow reporting, is a component of proceeds from investing activities.",
 "GeneralAndAdministrativeExpense": "The aggregate total of expenses of managing and administering the affairs of an entity, including affiliates of the reporting entity, which are not directly or indirectly associated with the manufacture, sale or creation of a product or product line.",
 "Goodwill": "Amount after accumulated impairment loss of an asset representing future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized.",
 "GoodwillAcquiredDuringPeriod": "Amount of increase in asset representing future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized resulting from a business combination.",
 "GoodwillAndIntangibleAssetImpairment": "Total loss recognized during the period from the impairment of goodwill plus the loss recognized in the period resulting from the impairment of the carrying amount of intangible assets, other than goodwill.",
 "GoodwillImpairmentLoss": "Amount of loss from the write-down of an asset representing the future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized.",
 "GoodwillOtherChanges": "Amount of other (increase) decrease of an asset representing the future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized.",
 "GoodwillOtherIncreaseDecrease": "Amount of increase (decrease), classified as other, of an asset representing the future economic benefits from other assets acquired in a business combination that are not individually identified and separately recognized.",
 "GoodwillTranslationAndPurchaseAccountingAdjustments": "Amount of increase (decrease) from foreign currency translation adjustments and purchase accounting adjustments of an asset representing future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized.",
 "GrossProfit": "Aggregate revenue less cost of goods and services sold or operating expenses directly attributable to the revenue generation activity.",
 "IncomeLossFromContinuingOperationsBeforeIncomeTaxesDomestic": "The portion of earnings or loss from continuing operations before income taxes that is attributable to domestic operations.",
 "IncomeLossFromContinuingOperationsBeforeIncomeTaxesForeign": "The portion of earnings or loss from continuing operations before income taxes that is attributable to foreign operations, which is defined as Income or Loss generated from operations located outside the entity's country of domicile.",
 "IncomeLossFromContinuingOperationsBeforeIncomeTaxesMinorityInterestAndIncomeLossFromEquityMethodInvestments": "Amount of income (loss) from continuing operations before deduction of income tax expense (benefit) and income (loss) attributable to noncontrolling interest, and addition of income (loss) from equity method investments.",
 "IncomeLossFromEquityMethodInvestments": "Amount of income (loss) for proportionate share of equity method investee's income (loss).",
 "IncomeTaxExaminationEstimateOfPossibleLoss": "Estimated amount of loss resulting from an adverse tax position.",
 "IncomeTaxExaminationLiabilityRecorded": "The estimated loss resulting from the income tax examination that has been accrued as of the balance sheet date, including interest and penalties.",
 "IncomeTaxExaminationPenaltiesAndInterestAccrued": "The amount of estimated penalties and interest accrued as of the balance sheet date arising from income tax examinations.",
 "IncomeTaxExaminationPenaltiesAndInterestExpense": "The sum of the amounts of estimated penalties and interest recognized in the period arising from income tax examinations.",
 "IncomeTaxExaminationRangeOfPossibleLosses": "The estimated range of reasonably possible losses resulting from an adverse position taken by a taxing authority.",
 "IncomeTaxExpenseBenefit": "Amount of current income tax expense (benefit) and deferred income tax expense (benefit) pertaining to continuing operations.",
 "IncomeTaxesPaid": "The amount of cash paid during the current period to foreign, federal, state, and local authorities as taxes on income.",
 "IncomeTaxesPaidNet": "The amount of cash paid during the current period to foreign, federal, state, and local authorities as taxes on income, net of any cash received during the current period as refunds for the overpayment of taxes.",
 "IncomeTaxReconciliationDeductionsQualifiedProductionActivities": "Amount of the difference between reported income tax expense (benefit) and the expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to deduction for qualified production activity.",
 "IncomeTaxReconciliationForeignIncomeTaxRateDifferential": "Amount of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to foreign income tax expense (benefit).",
 "IncomeTaxReconciliationIncomeTaxExpenseBenefitAtFederalStatutoryIncomeTaxRate": "The amount of income tax expense or benefit for the period computed by applying the domestic federal statutory tax rates to pretax income from continuing operations.",
 "IncomeTaxReconciliationNondeductibleExpenseShareBasedCompensationCost": "Amount of reported income tax expense (benefit) in excess of (less than) expected income tax expense (benefit) computed by applying domestic federal statutory income tax rate to pretax income (loss) from continuing operation, attributable to nondeductible expense for award under share-based payment arrangement. Includes, but is not limited to, expense determined to be nondeductible upon grant or after for award under share-based payment arrangement.",
 "IncomeTaxReconciliationOtherAdjustments": "Amount of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to other adjustments.",
 "IncomeTaxReconciliationStateAndLocalIncomeTaxes": "Amount of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to state and local income tax expense (benefit).",
 "IncomeTaxReconciliationTaxCredits": "Amount of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to tax credits. Including, but not limited to, research credit, foreign tax credit, investment tax credit, and other tax credits.",
 "IncreaseDecreaseInAccountsPayable": "The increase (decrease) during the reporting period in the aggregate amount of liabilities incurred (and for which invoices have typically been received) and payable to vendors for goods and services received that are used in an entity's business.",
 "IncreaseDecreaseInAccountsReceivable": "The increase (decrease) during the reporting period in amount due within one year (or one business cycle) from customers for the credit sale of goods and services.",
 "IncreaseDecreaseInAccountsReceivableAndOtherOperatingAssets": "Amount of increase (decrease) in receivables, and operating assets classified as other.",
 "IncreaseDecreaseInAccruedLiabilities": "The increase (decrease) during the reporting period in the aggregate amount of expenses incurred but not yet paid.",
 "IncreaseDecreaseInAccruedLiabilitiesAndOtherOperatingLiabilities": "Amount of increase (decrease) in accrued expenses, and obligations classified as other.",
 "IncreaseDecreaseInContractWithCustomerLiability": "Amount of increase (decrease) in obligation to transfer good or service to customer for which consideration has been received or is receivable.",
 "IncreaseDecreaseInDeferredRevenue": "Amount of increase (decrease) in deferred income and obligation to transfer product and service to customer for which consideration has been received or is receivable.",
 "IncreaseDecreaseInInventories": "The increase (decrease) during the reporting period in the aggregate value of all inventory held by the reporting entity, associated with underlying transactions that are classified as operating activities.",
 "IncrementalCommonSharesAttributableToShareBasedPaymentArrangements": "Additional shares included in the calculation of diluted EPS as a result of the potentially dilutive effect of share based payment arrangements using the treasury stock method.",
 "IndefiniteLivedIntangibleAssetsExcludingGoodwill": "Amount of assets, excluding financial assets and goodwill, lacking physical substance and having a projected indefinite period of benefit.",
 "IntangibleAssetsGrossExcludingGoodwill": "Amount before accumulated amortization of intangible assets, excluding goodwill.",
 "IntangibleAssetsNetExcludingGoodwill": "Sum of the carrying amounts of all intangible assets, excluding goodwill, as of the balance sheet date, net of accumulated amortization and impairment charges.",
 "InterestExpense": "Amount of the cost of borrowed funds accounted for as interest expense.",
 "InterestPaid": "Amount of cash paid for interest, including, but not limited to, capitalized interest and payment to settle zero-coupon bond attributable to accreted interest of debt discount and debt instrument with insignificant coupon interest rate in relation to effective interest rate of borrowing attributable to accreted interest of debt discount; classified as operating and investing activities.",
 "InventoryNet": "Amount after valuation and LIFO reserves of inventory expected to be sold, or consumed within one year or operating cycle, if longer.",
 "InventoryValuationReserves": "Amount of valuation reserve for inventory.",
 "InvestmentIncomeInterest": "Amount before accretion (amortization) of purchase discount (premium) of interest income on nonoperating securities.",
 "LeaseAndRentalExpense": "Amount of rent expense incurred for leased assets, including but not limited to, furniture and equipment, that is not directly or indirectly associated with the manufacture, sale or creation of a product or product line.",
 "LeaseCost": "Amount of lease cost recognized by lessee for lease contract.",
 "LesseeOperatingLeaseLiabilityPaymentsDue": "Amount of lessee's undiscounted obligation for lease payment for operating lease.",
 "LesseeOperatingLeaseLiabilityPaymentsDueAfterYearFive": "Amount of lessee's undiscounted obligation for lease payment for operating lease due after fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "LesseeOperatingLeaseLiabilityPaymentsDueNextTwelveMonths": "Amount of lessee's undiscounted obligation for lease payment for operating lease to be paid in next fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "LesseeOperatingLeaseLiabilityPaymentsDueYearFive": "Amount of lessee's undiscounted obligation for lease payment for operating lease to be paid in fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "LesseeOperatingLeaseLiabilityPaymentsDueYearFour": "Amount of lessee's undiscounted obligation for lease payment for operating lease to be paid in fourth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "LesseeOperatingLeaseLiabilityPaymentsDueYearThree": "Amount of lessee's undiscounted obligation for lease payment for operating lease to be paid in third fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "LesseeOperatingLeaseLiabilityPaymentsDueYearTwo": "Amount of lessee's undiscounted obligation for lease payment for operating lease to be paid in second fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "LesseeOperatingLeaseLiabilityPaymentsRemainderOfFiscalYear": "Amount of lessee's undiscounted obligation for lease payment for operating lease having initial or remaining lease term in excess of one year to be paid in remainder of current fiscal year.",
 "LesseeOperatingLeaseLiabilityUndiscountedExcessAmount": "Amount of lessee's undiscounted obligation for lease payments in excess of discounted obligation for lease payments for operating lease.",
 "LiabilitiesAndStockholdersEquity": "Amount of liabilities and equity items, including the portion of equity attributable to noncontrolling interests, if any.",
 "LiabilitiesCurrent": "Total obligations incurred as part of normal operations that are expected to be paid during the following twelve months or within one business cycle, if longer.",
 "LiabilitiesNoncurrent": "Amount of obligation due after one year or beyond the normal operating cycle, if longer.",
 "LineOfCreditFacilityFairValueOfAmountOutstanding": "Fair value of the amount outstanding under the credit facility.",
 "LineOfCreditFacilityMaximumBorrowingCapacity": "Maximum borrowing capacity under the credit facility without consideration of any current restrictions on the amount that could be borrowed or the amounts currently outstanding under the facility.",
 "LongTermDebt": "Amount, after unamortized (discount) premium and debt issuance costs, of long-term debt. Includes, but not limited to, notes payable, bonds payable, debentures, mortgage loans and commercial paper. Excludes capital lease obligations.",
 "LongTermDebtCurrent": "Amount, after unamortized (discount) premium and debt issuance costs, of long-term debt, classified as current. Includes, but not limited to, notes payable, bonds payable, debentures, mortgage loans and commercial paper. Excludes capital lease obligations.",
 "LongTermDebtFairValue": "The fair value amount of long-term debt whether such amount is presented as a separate caption or as a parenthetical disclosure. Additionally, this element may be used in connection with the fair value disclosures required in the footnote disclosures to the financial statements. The element may be used in both the balance sheet and disclosure in the same submission.",
 "LongTermDebtMaturitiesRepaymentsOfPrincipalAfterYearFive": "Amount of long-term debt payable, sinking fund requirement, and other securities issued that are redeemable by holder at fixed or determinable price and date, maturing after fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "LongTermDebtMaturitiesRepaymentsOfPrincipalInNextTwelveMonths": "Amount of long-term debt payable, sinking fund requirement, and other securities issued that are redeemable by holder at fixed or determinable price and date, maturing in next fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "LongTermDebtMaturitiesRepaymentsOfPrincipalInYearFive": "Amount of long-term debt payable, sinking fund requirement, and other securities issued that are redeemable by holder at fixed or determinable price and date, maturing in fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "LongTermDebtMaturitiesRepaymentsOfPrincipalInYearFour": "Amount of long-term debt payable, sinking fund requirement, and other securities issued that are redeemable by holder at fixed or determinable price and date, maturing in fourth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "LongTermDebtMaturitiesRepaymentsOfPrincipalInYearThree": "Amount of long-term debt payable, sinking fund requirement, and other securities issued that are redeemable by holder at fixed or determinable price and date, maturing in third fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "LongTermDebtMaturitiesRepaymentsOfPrincipalInYearTwo": "Amount of long-term debt payable, sinking fund requirement, and other securities issued that are redeemable by holder at fixed or determinable price and date, maturing in second fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "LongTermDebtNoncurrent": "Amount after unamortized (discount) premium and debt issuance costs of long-term debt classified as noncurrent and excluding amounts to be repaid within one year or the normal operating cycle, if longer. Includes, but not limited to, notes payable, bonds payable, debentures, mortgage loans and commercial paper. Excludes capital lease obligations.",
 "LongtermDebtWeightedAverageInterestRate": "Weighted average interest rate of long-term debt outstanding calculated at point in time.",
 "LossContingencyDamagesSoughtValue": "The value (monetary amount) of the award the plaintiff seeks in the legal matter.",
 "LossContingencyPatentsAllegedlyInfringedNumber": "Number of another entity's patents that the entity has allegedly infringed.",
 "MarketableSecuritiesCurrent": "Amount of investment in marketable security, classified as current.",
 "MarketableSecuritiesRealizedGainLoss": "Amount of realized gain (loss) on investment in marketable security, including other-than-temporary impairment (OTTI).",
 "MarketableSecuritiesUnrealizedGainLoss": "Amount of unrealized gain (loss) on investment in marketable security.",
 "MarketingAndAdvertisingExpense": "The total expense recognized in the period for promotion, public relations, and brand or product advertising.",
 "MarketingExpense": "Expenditures for planning and executing the conception, pricing, promotion, and distribution of ideas, goods, and services. Costs of public relations and corporate promotions are typically considered to be marketing costs.",
 "NetCashProvidedByUsedInFinancingActivities": "Amount of cash inflow (outflow) from financing activities, including discontinued operations. Financing activity cash flows include obtaining resources from owners and providing them with a return on, and a return of, their investment; borrowing money and repaying amounts borrowed, or settling the obligation; and obtaining and paying for other resources obtained from creditors on long-term credit.",
 "NetCashProvidedByUsedInInvestingActivities": "Amount of cash inflow (outflow) from investing activities, including discontinued operations. Investing activity cash flows include making and collecting loans and acquiring and disposing of debt or equity instruments and property, plant, and equipment and other productive assets.",
 "NetCashProvidedByUsedInOperatingActivities": "Amount of cash inflow (outflow) from operating activities, including discontinued operations. Operating activity cash flows include transactions, adjustments, and changes in value not defined as investing or financing activities.",
 "NetIncomeLoss": "The portion of profit or loss for the period, net of income taxes, which is attributable to the parent.",
 "NewAccountingPronouncementOrChangeInAccountingPrincipleEffectOfChangeOnNetRevenue": "Amount of the effect of a change in accounting principle on net revenue.",
 "NonoperatingIncomeExpense": "The aggregate amount of income or expense from ancillary business-related activities (that is to say, excluding major activities considered part of the normal operations of the business).",
 "NumberOfOperatingSegments": "Number of operating segments. An operating segment is a component of an enterprise: (a) that engages in business activities from which it may earn revenues and incur expenses (including revenues and expenses relating to transactions with other components of the same enterprise), (b) whose operating results are regularly reviewed by the enterprise's chief operating decision maker to make decisions about resources to be allocated to the segment and assess its performance, and (c) for which discrete financial information is available. An operating segment may engage in business activities for which it has yet to earn revenues, for example, start-up operations may be operating segments before earning revenues.",
 "OperatingExpenses": "Generally recurring costs associated with normal operations except for the portion of these expenses which can be clearly related to production and included in cost of sales or services. Includes selling, general and administrative expense.",
 "OperatingIncomeLoss": "The net result for the period of deducting operating expenses from operating revenues.",
 "OperatingLeaseCost": "Amount of single lease cost, calculated by allocation of remaining cost of lease over remaining lease term. Includes, but is not limited to, single lease cost, after impairment of right-of-use asset, calculated by amortization of remaining right-of-use asset and accretion of lease liability.",
 "OperatingLeaseLiability": "Present value of lessee's discounted obligation for lease payments from operating lease.",
 "OperatingLeaseLiabilityCurrent": "Present value of lessee's discounted obligation for lease payments from operating lease, classified as current.",
 "OperatingLeaseLiabilityNoncurrent": "Present value of lessee's discounted obligation for lease payments from operating lease, classified as noncurrent.",
 "OperatingLeasePayments": "Amount of cash outflow from operating lease, excluding payments to bring another asset to condition and location necessary for its intended use.",
 "OperatingLeaseRightOfUseAsset": "Amount of lessee's right to use underlying asset under operating lease.",
 "OperatingLeasesFutureMinimumPaymentsDue": "Amount of required minimum rental payments for leases having an initial or remaining non-cancelable letter-terms in excess of one year.",
 "OperatingLeasesFutureMinimumPaymentsDueCurrent": "Amount of required minimum rental payments for operating leases having an initial or remaining non-cancelable lease term in excess of one year due in the next fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date.",
 "OperatingLeasesFutureMinimumPaymentsDueInFiveYears": "Amount of required minimum rental payments for operating leases having an initial or remaining non-cancelable lease term in excess of one year due in the fifth fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date.",
 "OperatingLeasesFutureMinimumPaymentsDueInFourYears": "Amount of required minimum rental payments for operating leases having an initial or remaining non-cancelable lease term in excess of one year due in the fourth fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date.",
 "OperatingLeasesFutureMinimumPaymentsDueInThreeYears": "Amount of required minimum rental payments for operating leases having an initial or remaining non-cancelable lease term in excess of one year due in the third fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date.",
 "OperatingLeasesFutureMinimumPaymentsDueInTwoYears": "Amount of required minimum rental payments for operating leases having an initial or remaining non-cancelable lease term in excess of one year due in the second fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date.",
 "OperatingLeasesFutureMinimumPaymentsDueThereafter": "Amount of required minimum rental payments for operating leases having an initial or remaining non-cancelable lease term in excess of one year due after the fifth fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date.",
 "OperatingLeasesFutureMinimumPaymentsRemainderOfFiscalYear": "Amount of required minimum rental payments for operating leases having an initial or remaining non-cancelable lease term in excess of one year due in the remainder of the fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date.",
 "OperatingLeaseWeightedAverageDiscountRatePercent": "Weighted average discount rate for operating lease calculated at point in time.",
 "OperatingLossCarryforwards": "Amount of operating loss carryforward, before tax effects, available to reduce future taxable income under enacted tax laws.",
 "OtherAdjustmentsForNoncashItemsIncludedInIncomeLossFromContinuingOperations": "Transactions that result in no cash inflows or outflows in the period in which they occur, but affect net income and thus are removed when calculating net cash flow from operating activities using the indirect method. This element is used when there is not a more specific and appropriate element.",
 "OtherAssetsNoncurrent": "Amount of noncurrent assets classified as other.",
 "OtherCommitment": "Minimum amount of other commitment not otherwise specified in the taxonomy. Excludes commitments explicitly modeled in the taxonomy, including but not limited to, long-term and short-term purchase commitments, recorded and unrecorded purchase obligations, supply commitments, registration payment arrangements, leases, debt, product warranties, guarantees, environmental remediation obligations, and pensions.",
 "OtherCommitmentDueAfterFifthYear": "Amount of commitment classified as other to be paid after fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "OtherCommitmentDueInFifthYear": "Amount of commitment classified as other to be paid in fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "OtherCommitmentDueInFourthYear": "Amount of commitment classified as other to be paid in fourth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "OtherCommitmentDueInNextTwelveMonths": "Amount of commitment classified as other to be paid in next fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "OtherCommitmentDueInSecondYear": "Amount of commitment classified as other to be paid in second fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "OtherCommitmentDueInThirdYear": "Amount of commitment classified as other to be paid in third fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "OtherCommitmentsFutureMinimumPaymentsRemainderOfFiscalYear": "Amount of commitment classified as other to be paid in remainder of current fiscal year.",
 "OtherComprehensiveIncomeAvailableForSaleSecuritiesAdjustmentNetOfTaxPeriodIncreaseDecrease": "Gross appreciation or the gross loss in value of the total unsold securities. While for technical reasons this element has no balance attribute, the default assumption is a credit balance consistent with its label.",
 "OtherComprehensiveIncomeAvailableForSaleSecuritiesTax": "Tax effect of the gross appreciation or the gross loss, net of reclassification adjustment, in the value of the total unsold available-for-sale securities at the end of an accounting period.",
 "OtherComprehensiveIncomeForeignCurrencyTransactionAndTranslationGainLossArisingDuringPeriodNetOfTax": "Amount after tax, before reclassification adjustments of gain (loss) on foreign currency translation adjustments, foreign currency transactions designated and effective as economic hedges of a net investment in a foreign entity and intra-entity foreign currency transactions that are of a long-term-investment nature.",
 "OtherComprehensiveIncomeForeignCurrencyTranslationAdjustmentTax": "Tax effect of the adjustment that results from the process of translating subsidiary financial statements and foreign equity investments into functional currency of the reporting entity. While for technical reasons this element has no balance attribute, the default assumption is a credit balance consistent with its label.",
 "OtherComprehensiveIncomeForeignCurrencyTranslationGainLossArisingDuringPeriodTax": "Amount of tax expense (benefit), before reclassification adjustments of gain (loss) on foreign currency translation adjustments, foreign currency transactions designated and effective as economic hedges of a net investment in a foreign entity and intra-entity foreign currency transactions that are of a long-term-investment nature.",
 "OtherComprehensiveIncomeLossAvailableForSaleSecuritiesAdjustmentNetOfTax": "Amount, after tax and adjustment, of unrealized gain (loss) on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale) and unrealized gain (loss) on investment in debt security measured at amortized cost (held-to-maturity) from transfer to available-for-sale.",
 "OtherComprehensiveIncomeLossAvailableForSaleSecuritiesTax": "Amount, after adjustment, of tax expense (benefit) for unrealized gain (loss) on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale) and tax expense (benefit) for unrealized gain (loss) on investment in debt security measured at amortized cost (held-to-maturity) from transfer to available-for-sale.",
 "OtherComprehensiveIncomeLossForeignCurrencyTransactionAndTranslationAdjustmentNetOfTax": "Amount after tax and reclassification adjustments of gain (loss) on foreign currency translation adjustments, foreign currency transactions designated and effective as economic hedges of a net investment in a foreign entity and intra-entity foreign currency transactions that are of a long-term-investment nature.",
 "OtherComprehensiveIncomeLossForeignCurrencyTransactionAndTranslationReclassificationAdjustmentFromAOCIRealizedUponSaleOrLiquidationNetOfTax": "Amount after tax of reclassification adjustment from accumulated other comprehensive income for translation gain (loss) realized upon the sale or liquidation of an investment in a foreign entity and foreign currency hedges that are designated and qualified as hedging instruments for hedges of the foreign currency exposure of a net investment in a foreign operation.",
 "OtherComprehensiveIncomeLossForeignCurrencyTransactionAndTranslationReclassificationAdjustmentFromAOCIRealizedUponSaleOrLiquidationTax": "Amount of tax expense (benefit) of reclassification adjustment from accumulated other comprehensive income for translation gain (loss) realized upon the sale or liquidation of an investment in a foreign entity and foreign currency hedges that are designated and qualified as hedging instruments for hedges of the foreign currency exposure of a net investment in a foreign operation.",
 "OtherComprehensiveIncomeLossForeignCurrencyTranslationAdjustmentTax": "Amount of tax expense (benefit), after reclassification adjustments of gain (loss) on foreign currency translation adjustments, foreign currency transactions designated and effective as economic hedges of a net investment in a foreign entity and intra-entity foreign currency transactions that are of a long-term-investment nature.",
 "OtherComprehensiveIncomeLossNetOfTax": "Amount after tax and reclassification adjustments of other comprehensive income (loss).",
 "OtherComprehensiveIncomeLossNetOfTaxPeriodIncreaseDecrease": "This element represents Other Comprehensive Income or Loss, Net of Tax, for the period. Includes deferred gains or losses on qualifying hedges, unrealized holding gains or losses on available-for-sale securities, minimum pension liability, and cumulative translation adjustment. While for technical reasons this element has no balance attribute, the default assumption is a credit balance consistent with its label.",
 "OtherComprehensiveIncomeLossReclassificationAdjustmentForSaleOfSecuritiesIncludedInNetIncomeNetOfTax": "Net of tax amount of the income statement impact of the reclassification adjustment for unrealized gain (loss) realized upon the sale of available-for-sale securities.",
 "OtherComprehensiveIncomeLossReclassificationAdjustmentForSaleOfSecuritiesIncludedInNetIncomeTax": "Tax effect of the income statement impact of the reclassification adjustment for unrealized gain (loss) realized upon the sale of available-for-sale securities.",
 "OtherComprehensiveIncomeLossReclassificationAdjustmentFromAOCIForSaleOfSecuritiesNetOfTax": "Amount after tax of reclassification adjustment from accumulated other comprehensive income for unrealized gain (loss) realized upon the sale of available-for-sale securities.",
 "OtherComprehensiveIncomeLossReclassificationAdjustmentFromAOCIForSaleOfSecuritiesTax": "Amount of tax expense (benefit) of reclassification adjustment from accumulated other comprehensive income for unrealized gain (loss) realized upon the sale of available-for-sale securities.",
 "OtherComprehensiveIncomeOtherNetOfTax": "Amount of increase (decrease) in other comprehensive income, after tax, from changes classified as other.",
 "OtherComprehensiveIncomeReclassificationAdjustmentForSaleOfSecuritiesIncludedInNetIncomeNetOfTax": "Reclassification adjustment for unrealized gains or losses realized upon the sale of securities, after tax.",
 "OtherComprehensiveIncomeReclassificationAdjustmentForSaleOfSecuritiesIncludedInNetIncomeTax": "Tax effect on the reclassification adjustment for gains or losses realized upon the sale of securities during the period.",
 "OtherComprehensiveIncomeUnrealizedGainLossOnDerivativesArisingDuringPeriodNetOfTax": "Amount after tax of increase (decrease) in accumulated gain (loss) from derivative instruments designated and qualifying as the effective portion of cash flow hedges and an entity's share of an equity investee's increase (decrease) in deferred hedging gain (loss).",
 "OtherComprehensiveIncomeUnrealizedHoldingGainLossOnSecuritiesArisingDuringPeriodNetOfTax": "Amount, after tax and before adjustment, of unrealized holding gain (loss) on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale). Excludes unrealized gain (loss) on investment in debt security measured at amortized cost (held-to-maturity) from transfer to available-for-sale.",
 "OtherComprehensiveIncomeUnrealizedHoldingGainLossOnSecuritiesArisingDuringPeriodTax": "Amount, before adjustment, of tax expense (benefit) for unrealized holding gain (loss) on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale). Excludes tax expense (benefit) for unrealized gain (loss) on investment in debt security measured at amortized cost (held-to-maturity) from transfer to available-for-sale.",
 "OtherCostAndExpenseOperating": "The total amount of other operating cost and expense items that are associated with the entity's normal revenue producing operation.",
 "OtherLiabilitiesAndDeferredRevenueNoncurrent": "Aggregate carrying amount, as of the balance sheet date, of noncurrent obligations and noncurrent portion of deferred revenue not separately disclosed in the balance sheet. Noncurrent liabilities are expected to be paid after one year (or the normal operating cycle, if longer). Deferred revenue is a liability related to a revenue producing activity for which revenue has not yet been recognized, and is not expected to be recognized in the next twelve months.",
 "OtherLiabilitiesNoncurrent": "Amount of liabilities classified as other, due after one year or the normal operating cycle, if longer.",
 "OtherLongTermDebt": "Amount of long-term debt classified as other.",
 "OtherNoncashIncomeExpense": "Amount of income (expense) included in net income that results in no cash inflow (outflow), classified as other.",
 "OtherNoncurrentLiabilities": "Obligations not otherwise itemized or previously categorized that are due beyond one year (or operating cycle, if longer) from the balance sheet date.",
 "OtherNonoperatingIncomeExpense": "Amount of income (expense) related to nonoperating activities, classified as other.",
 "OtherOperatingActivitiesCashFlowStatement": "Other cash or noncash adjustments to reconcile net income to cash provided by (used in) operating activities that are not separately disclosed in the statement of cash flows (for example, cash received or cash paid during the current period for miscellaneous operating activities, net change during the reporting period in other assets or other liabilities).",
 "OtherOperatingIncome": "The total amount of other operating income, the components of which are not separately disclosed on the income statement, from items that are associated with the entity's normal revenue producing operation.",
 "OtherOperatingIncomeExpenseNet": "The net amount of other operating income and expenses, the components of which are not separately disclosed on the income statement, from items that are associated with the entity's normal revenue producing operations.",
 "OtherRestrictedAssetsCurrent": "Amount of current assets that are pledged or subject to withdrawal restrictions, classified as other.",
 "OtherTaxExpenseBenefit": "Amount of other income tax expense (benefit).",
 "PaymentsForProceedsFromProductiveAssets": "The net cash outflow or inflow from purchases, sales and disposals of property, plant and equipment and other productive assets, including intangibles.",
 "PaymentsForRepurchaseOfCommonStock": "The cash outflow to reacquire common stock during the period.",
 "PaymentsToAcquireBusinessesAndInterestInAffiliates": "The cash outflow associated with the acquisition of a controlling interest in another entity or an entity that is related to it but not strictly controlled (for example, an unconsolidated subsidiary, affiliate, joint venture or equity method investment).",
 "PaymentsToAcquireBusinessesNetOfCashAcquired": "The cash outflow associated with the acquisition of a business, net of the cash acquired from the purchase.",
 "PaymentsToAcquireInvestments": "The cash outflow associated with the purchase of all investments (debt, security, other) during the period.",
 "PaymentsToAcquireMarketableSecurities": "Amount of cash outflow for purchase of marketable security.",
 "PaymentsToAcquireProductiveAssets": "The cash outflow for purchases of and capital improvements on property, plant and equipment (capital expenditures), software, and other intangible assets.",
 "PaymentsToAcquirePropertyPlantAndEquipment": "The cash outflow associated with the acquisition of long-lived, physical assets that are used in the normal conduct of business to produce goods and services and not intended for resale; includes cash outflows to pay for construction of self-constructed assets.",
 "PreferredStockParOrStatedValuePerShare": "Face amount or stated value per share of preferred stock nonredeemable or redeemable solely at the option of the issuer.",
 "PreferredStockSharesAuthorized": "The maximum number of nonredeemable preferred shares (or preferred stock redeemable solely at the option of the issuer) permitted to be issued by an entity's charter and bylaws.",
 "PreferredStockSharesIssued": "Total number of nonredeemable preferred shares (or preferred stock redeemable solely at the option of the issuer) issued to shareholders (includes related preferred shares that were issued, repurchased, and remain in the treasury). May be all or portion of the number of preferred shares authorized. Excludes preferred shares that are classified as debt.",
 "PreferredStockSharesOutstanding": "Aggregate share number for all nonredeemable preferred stock (or preferred stock redeemable solely at the option of the issuer) held by stockholders. Does not include preferred shares that have been repurchased.",
 "PreferredStockValue": "Aggregate par or stated value of issued nonredeemable preferred stock (or preferred stock redeemable solely at the option of the issuer). This item includes treasury stock repurchased by the entity. Note: elements for number of nonredeemable preferred shares, par value and other disclosure concepts are in another section within stockholders' equity.",
 "ProceedsFromIssuanceOfLongTermDebt": "The cash inflow from a debt initially having maturity due after one year or beyond the operating cycle, if longer.",
 "ProceedsFromRepaymentsOfLongTermDebtAndCapitalSecurities": "Amount of cash inflow (outflow) from long-term debt, including capital lease obligations and mandatory redeemable capital securities.",
 "ProceedsFromSaleAndMaturityOfMarketableSecurities": "The cash inflow associated with the aggregate amount received by the entity through sale or maturity of marketable securities (held-to-maturity or available-for-sale) during the period.",
 "ProceedsFromSaleMaturityAndCollectionsOfInvestments": "The cash inflow associated with the sale, maturity and collection of all investments such as debt, security and so forth during the period.",
 "ProceedsFromShortTermDebt": "The cash inflow from a borrowing having initial term of repayment within one year or the normal operating cycle, if longer.",
 "PropertyPlantAndEquipmentAdditions": "Amount of acquisition of long-lived, physical assets used in the normal conduct of business and not intended for resale. Examples include, but are not limited to, land, buildings, machinery and equipment, office equipment, furniture and fixtures, and computer equipment.",
 "PropertyPlantAndEquipmentAndFinanceLeaseRightOfUseAssetAccumulatedDepreciationAndAmortization": "Amount of accumulated depreciation and amortization from plant, property, and equipment and right-of-use asset from finance lease.",
 "PropertyPlantAndEquipmentAndFinanceLeaseRightOfUseAssetAfterAccumulatedDepreciationAndAmortization": "Amount, after accumulated depreciation and amortization, of property, plant, and equipment and finance lease right-of-use asset.",
 "PropertyPlantAndEquipmentAndFinanceLeaseRightOfUseAssetBeforeAccumulatedDepreciationAndAmortization": "Amount, before accumulated depreciation and amortization, of property, plant, and equipment and finance lease right-of-use asset.",
 "PropertyPlantAndEquipmentGross": "Amount before accumulated depreciation, depletion and amortization of physical assets used in the normal conduct of business and not intended for resale. Examples include, but are not limited to, land, buildings, machinery and equipment, office equipment, and furniture and fixtures.",
 "PropertyPlantAndEquipmentNet": "Amount after accumulated depreciation, depletion and amortization of physical assets used in the normal conduct of business to produce goods and services and not intended for resale. Examples include, but are not limited to, land, buildings, machinery and equipment, office equipment, and furniture and fixtures.",
 "ProvisionForDoubtfulAccounts": "Amount of expense (reversal of expense) for expected credit loss on accounts receivable.",
 "RecognitionOfDeferredRevenue": "The amount of previously reported deferred or unearned revenue that was recognized as revenue during the period. For cash flows, this element primarily pertains to amortization of deferred credits on long-term arrangements. As a noncash item, it is deducted from net income when calculating cash provided by or used in operations using the indirect method.",
 "RepaymentsOfDebt": "The cash outflow during the period from the repayment of aggregate short-term and long-term debt. Excludes payment of capital lease obligations.",
 "RepaymentsOfLongTermCapitalLeaseObligations": "The cash outflow for the obligation for a lease meeting the criteria for capitalization (with maturities exceeding one year or beyond the operating cycle of the entity, if longer).",
 "RepaymentsOfLongTermDebt": "The cash outflow for debt initially having maturity due after one year or beyond the normal operating cycle, if longer.",
 "RepaymentsOfLongTermDebtAndCapitalSecurities": "Amount of cash outflow for debt, mandatory redeemable security, and principal payment for finance lease obligation.",
 "RepaymentsOfShortTermDebt": "The cash outflow for a borrowing having initial term of repayment within one year or the normal operating cycle, if longer.",
 "RestrictedCashAndCashEquivalents": "Amount of cash and cash equivalents restricted as to withdrawal or usage. Cash includes, but is not limited to, currency on hand, demand deposits with banks or financial institutions, and other accounts with general characteristics of demand deposits. Cash equivalents include, but are not limited to, short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates.",
 "RestrictedCashCurrent": "Amount of cash restricted as to withdrawal or usage, classified as current. Cash includes, but is not limited to, currency on hand, demand deposits with banks or financial institutions, and other accounts with general characteristics of demand deposits.",
 "RestrictedCashNoncurrent": "Amount of cash restricted as to withdrawal or usage, classified as noncurrent. Cash includes, but is not limited to, currency on hand, demand deposits with banks or financial institutions, and other accounts with general characteristics of demand deposits.",
 "RetainedEarningsAccumulatedDeficit": "The cumulative amount of the reporting entity's undistributed earnings or deficit.",
 "RevenueFromContractWithCustomerExcludingAssessedTax": "Amount, excluding tax collected from customer, of revenue from satisfaction of performance obligation by transferring promised good or service to customer. Tax collected from customer is tax assessed by governmental authority that is both imposed on and concurrent with specific revenue-producing transaction, including, but not limited to, sales, use, value added and excise.",
 "RevenueRecognitionSalesReturnsReserveForSalesReturns": "Amount of estimated sales returns.",
 "RevenueRemainingPerformanceObligation": "Amount of transaction price allocated to performance obligation that has not been recognized as revenue.",
 "RightOfUseAssetObtainedInExchangeForFinanceLeaseLiability": "Amount of increase in right-of-use asset obtained in exchange for finance lease liability.",
 "RightOfUseAssetObtainedInExchangeForOperatingLeaseLiability": "Amount of increase in right-of-use asset obtained in exchange for operating lease liability.",
 "SalesReturnsAndAllowancesGoods": "Total deduction from sales during the period arising from goods returned by customers (other than under warranty provisions) and price reductions (allowance, price protection agreements) given by the entity. Returns and allowances are a deduction from gross revenue in arriving at net revenue.",
 "SalesRevenueGoodsNet": "Aggregate revenue during the period from the sale of goods in the normal course of business, after deducting returns, allowances and discounts.",
 "SalesRevenueNet": "Total revenue from sale of goods and services rendered during the reporting period, in the normal course of business, reduced by sales returns and allowances, and sales discounts.",
 "SalesRevenueServicesNet": "Aggregate revenue during the period from services rendered in the normal course of business, after deducting allowances and discounts.",
 "SecurityOwnedAndPledgedAsCollateralFairValue": "Fair value of financial instrument held by the entity for its own account (proprietary securities) for trading or investment purposes that are carried at fair value and pledged to counterparties as collateral for financing transactions.",
 "SegmentReportingSegmentOperatingProfitLoss": "The total amount of profit or loss for reportable segments.",
 "ShareBasedCompensation": "Amount of noncash expense for share-based payment arrangement.",
 "ShareBasedCompensationArrangementByShareBasedPaymentAwardEquityInstrumentsOtherThanOptionsGrantsInPeriod": "The number of grants made during the period on other than stock (or unit) option plans (for example, phantom stock or unit plan, stock or unit appreciation rights plan, performance target plan).",
 "ShareBasedCompensationArrangementByShareBasedPaymentAwardEquityInstrumentsOtherThanOptionsGrantsInPeriodWeightedAverageGrantDateFairValue": "The weighted average fair value at grant date for nonvested equity-based awards issued during the period on other than stock (or unit) option plans (for example, phantom stock or unit plan, stock or unit appreciation rights plan, performance target plan).",
 "ShareBasedCompensationArrangementByShareBasedPaymentAwardEquityInstrumentsOtherThanOptionsNonvestedNumber": "The number of non-vested equity-based payment instruments, excluding stock (or unit) options, that validly exist and are outstanding as of the balance sheet date.",
 "ShareBasedCompensationArrangementByShareBasedPaymentAwardEquityInstrumentsOtherThanOptionsVestedInPeriod": "The number of equity-based payment instruments, excluding stock (or unit) options, that vested during the reporting period.",
 "ShareBasedCompensationArrangementByShareBasedPaymentAwardEquityInstrumentsOtherThanOptionsVestedInPeriodTotalFairValue": "Fair value of share-based awards for which the grantee gained the right by satisfying service and performance requirements, to receive or retain shares or units, other instruments, or cash.",
 "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsOutstandingNumber": "Number of options outstanding, including both vested and non-vested options.",
 "StockholdersEquity": "Total of all stockholders' equity (deficit) items, net of receivables from officers, directors, owners, and affiliates of the entity which are attributable to the parent. The amount of the economic entity's stockholders' equity attributable to the parent excludes the amount of stockholders' equity which is allocable to that ownership interest in subsidiary equity which is not attributable to the parent (noncontrolling interest, minority interest). This excludes temporary equity and is sometimes called permanent equity.",
 "StockIssuedDuringPeriodSharesEmployeeBenefitPlan": "Number of shares issued during the period to an employee benefit plan, such as a defined contribution or defined benefit plan.",
 "StockIssuedDuringPeriodValueAcquisitions": "Value of stock issued pursuant to acquisitions during the period.",
 "StockIssuedDuringPeriodValueEmployeeBenefitPlan": "Value of shares issued during the period to an employee benefit plan, such as a defined contribution or defined benefit plan.",
 "StockIssuedDuringPeriodValueShareBasedCompensation": "Value, after forfeiture, of shares issued under share-based payment arrangement. Excludes employee stock ownership plan (ESOP).",
 "StockIssuedDuringPeriodValueStockOptionsExercised": "Value of stock issued as a result of the exercise of stock options.",
 "StockRepurchasedDuringPeriodShares": "Number of shares that have been repurchased during the period and have not been retired and are not held in treasury. Some state laws may govern the circumstances under which an entity may acquire its own stock and prescribe the accounting treatment therefore. This element is used when state law does not recognize treasury stock.",
 "StockRepurchasedDuringPeriodValue": "Equity impact of the value of stock that has been repurchased during the period and has not been retired and is not held in treasury. Some state laws may mandate the circumstances under which an entity may acquire its own stock and prescribe the accounting treatment therefore. This element is used when state law does not recognize treasury stock.",
 "StockRepurchaseProgramAuthorizedAmount1": "Amount of stock repurchase plan authorized.",
 "StockRepurchaseProgramNumberOfSharesAuthorizedToBeRepurchased": "The number of shares authorized to be repurchased by an entity's Board of Directors under a stock repurchase plan.",
 "StockRepurchaseProgramRemainingAuthorizedRepurchaseAmount1": "Amount remaining of a stock repurchase plan authorized.",
 "TaxCreditCarryforwardAmount": "The amount of the tax credit carryforward, before tax effects, available to reduce future taxable income under enacted tax laws.",
 "TaxCreditCarryforwardDeferredTaxAsset": "Amount of deferred tax asset, before valuation allowance, attributable to deductible other tax carryforwards.",
 "TranslationAdjustmentFunctionalToReportingCurrencyIncreaseDecreaseGrossOfTax": "Amount of cumulative translation gain (loss), before tax, from translating foreign currency financial statements into the reporting currency.",
 "TreasuryStockValue": "The amount allocated to treasury stock. Treasury stock is common and preferred shares of an entity that were issued, repurchased by the entity, and are held in its treasury.",
 "UndistributedEarningsOfForeignSubsidiaries": "Amount of undistributed earnings of foreign subsidiaries intended to be permanently reinvested outside the country of domicile.",
 "UnrecognizedTaxBenefits": "Amount of unrecognized tax benefits.",
 "UnrecognizedTaxBenefitsDecreasesResultingFromPriorPeriodTaxPositions": "Amount of decrease in unrecognized tax benefits resulting from tax positions taken in prior period tax returns.",
 "UnrecognizedTaxBenefitsDecreasesResultingFromSettlementsWithTaxingAuthorities": "Amount of decrease in unrecognized tax benefits resulting from settlements with taxing authorities.",
 "UnrecognizedTaxBenefitsIncomeTaxPenaltiesAndInterestAccrued": "Amount accrued for interest on an underpayment of income taxes and penalties related to a tax position claimed or expected to be claimed in the tax return.",
 "UnrecognizedTaxBenefitsIncomeTaxPenaltiesAndInterestExpense": "Amount of expense for interest on an underpayment of income taxes and penalties related to a tax position claimed or expected to be claimed in the tax return.",
 "UnrecognizedTaxBenefitsIncreasesResultingFromCurrentPeriodTaxPositions": "Amount of increase in unrecognized tax benefits resulting from tax positions that have been or will be taken in current period tax return.",
 "UnrecognizedTaxBenefitsIncreasesResultingFromPriorPeriodTaxPositions": "Amount of increase in unrecognized tax benefits resulting from tax positions taken in prior period tax returns.",
 "UnrecognizedTaxBenefitsReductionsResultingFromLapseOfApplicableStatuteOfLimitations": "Amount of decrease in unrecognized tax benefits resulting from lapses of applicable statutes of limitations.",
 "UnrecognizedTaxBenefitsResultingInNetOperatingLossCarryforward": "Amount of an unrecognized tax benefit that is directly related to a position taken in a tax year that results in a net operating loss carryforward. This amount is presented as a reduction of the related deferred tax asset in the balance sheet if that deferred tax asset is not used. This amount is presented separately from the deferred tax asset for a net operating loss carryforward if this unrelated tax benefit is associated with a different tax position.",
 "UnrecognizedTaxBenefitsThatWouldImpactEffectiveTaxRate": "The total amount of unrecognized tax benefits that, if recognized, would affect the effective tax rate.",
 "UnrecordedUnconditionalPurchaseObligationBalanceOnFifthAnniversary": "Amount of fixed and determinable portion of unrecorded unconditional purchase obligation to be paid in fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "UnrecordedUnconditionalPurchaseObligationBalanceOnFirstAnniversary": "Amount of fixed and determinable portion of unrecorded unconditional purchase obligation to be paid in next fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "UnrecordedUnconditionalPurchaseObligationBalanceOnFourthAnniversary": "Amount of fixed and determinable portion of unrecorded unconditional purchase obligation to be paid in fourth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "UnrecordedUnconditionalPurchaseObligationBalanceOnSecondAnniversary": "Amount of fixed and determinable portion of unrecorded unconditional purchase obligation to be paid in second fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "UnrecordedUnconditionalPurchaseObligationBalanceOnThirdAnniversary": "Amount of fixed and determinable portion of unrecorded unconditional purchase obligation to be paid in third fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "UnrecordedUnconditionalPurchaseObligationBalanceSheetAmount": "Amount of the unrecorded obligation to transfer funds in the future for fixed or minimum amounts or quantities of goods or services at fixed or minimum prices (for example, as in take-or-pay contracts or throughput contracts).",
 "UnrecordedUnconditionalPurchaseObligationDueAfterFiveYears": "Amount of fixed and determinable portion of unrecorded unconditional purchase obligation to be paid after fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
 "UnrecordedUnconditionalPurchaseObligationDueInRemainderOfFiscalYear": "Amount of fixed and determinable portion of unrecorded unconditional purchase obligation to be paid in remainder of current fiscal year.",
 "ValuationAllowanceDeferredTaxAssetChangeInAmount": "Amount of increase (decrease) in the valuation allowance for a specified deferred tax asset.",
 "VariableLeaseCost": "Amount of variable lease cost, excluded from lease liability, recognized when obligation for payment is incurred for finance and operating leases.",
 "WeightedAverageNumberOfDilutedSharesOutstanding": "The average number of shares or units issued and outstanding that are used in calculating diluted EPS or earnings per unit (EPU), determined based on the timing of issuance of shares or units in the period.",
 "WeightedAverageNumberOfSharesOutstandingBasic": "Number of [basic] shares or units, after adjustment for contingently issuable shares or units and other shares or units not deemed outstanding, determined by relating the portion of time within a reporting period that common shares or units have been outstanding to the total time in that period.",
 "DeferredTaxLiabilitiesInvestments": "Amount of deferred tax liability attributable to taxable temporary differences from investments (excludes investments in subsidiaries and equity method investments).",
 "EmployeeRelatedLiabilitiesCurrent": "Total of the carrying values as of the balance sheet date of obligations incurred through that date and payable for obligations related to services received from employees, such as accrued salaries and bonuses, payroll taxes and fringe benefits. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer).",
 "IncomeTaxReconciliationChangeInDeferredTaxAssetsValuationAllowance": "Amount of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to increase (decrease) in the valuation allowance for deferred tax assets.",
 "EffectOfExchangeRateOnCashCashEquivalentsRestrictedCashAndRestrictedCashEquivalents": "Amount of increase (decrease) from effect of exchange rate changes on cash and cash equivalents, and cash and cash equivalents restricted to withdrawal or usage; held in foreign currencies. Excludes amounts for disposal group and discontinued operations. Cash includes, but is not limited to, currency on hand, demand deposits with banks or financial institutions, and other accounts with general characteristics of demand deposits. Cash equivalents include, but are not limited to, short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates.",
 "EffectOfExchangeRateOnCashCashEquivalentsRestrictedCashAndRestrictedCashEquivalentsIncludingDisposalGroupAndDiscontinuedOperations": "Amount of increase (decrease) from effect of exchange rate changes on cash and cash equivalents, and cash and cash equivalents restricted to withdrawal or usage; held in foreign currencies; including, but not limited to, disposal group and discontinued operations. Cash includes, but is not limited to, currency on hand, demand deposits with banks or financial institutions, and other accounts with general characteristics of demand deposits. Cash equivalents include, but are not limited to, short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates.",
 "ShortTermBorrowings": "Reflects the total carrying amount as of the balance sheet date of debt having initial terms less than one year or the normal operating cycle, if longer.",
 "StockholdersEquityNoteStockSplitConversionRatio1": "Ratio applied to the conversion of stock split, for example but not limited to, one share converted to two or two shares converted to one.",
 "TreasuryStockCommonValue": "Amount allocated to previously issued common shares repurchased by the issuing entity and held in treasury.",
 "AssetImpairmentCharges": "Amount of write-down of assets recognized in the income statement. Includes, but is not limited to, losses from tangible assets, intangible assets and goodwill.",
 "DeferredTaxAssetsInProcessResearchAndDevelopment": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences from in-process research and development costs expensed in connection with a business combination.",
 "EffectiveIncomeTaxRateReconciliationFdiiAmount": null,
 "GainLossOnContractTermination": "Gain (loss) related to the termination of a contract between the parties. The termination may be due to many causes including early termination of a lease by a lessee, a breach of contract by one party, or a failure to perform.",
 "IncreaseDecreaseInSelfInsuranceReserve": "The increase (decrease) during the period in the carrying amount of accrued known and estimated losses incurred for which no insurance coverage exists, and for which a claim has been made or is probable of being asserted, typically arising from workmen's' compensation-type of incidents and personal injury to nonemployees from accidents on the entity's property.",
 "SelfInsuranceReserve": "Carrying amount (including both current and noncurrent portions) of accrued known and estimated losses incurred as of the balance sheet date for which no insurance coverage exists, and for which a claim has been made or is probable of being asserted, typically arising from workmen's compensation-type of incidents and personal injury to nonemployees from accidents on the entity's property.",
 "SeveranceCosts1": "Amount of expenses for special or contractual termination benefits provided to current employees involuntarily terminated under a benefit arrangement associated exit or disposal activities pursuant to an authorized plan. Excludes expenses related to one-time termination benefits, a discontinued operation or an asset retirement obligation.",
 "TreasuryStockValueAcquiredCostMethod": "Equity impact of the cost of common and preferred stock that were repurchased during the period. Recorded using the cost method.",
 "IncomeTaxReconciliationTaxCreditsResearch": "Amount of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to research tax credit.",
 "LossOnContractTermination": "The loss recognized on termination of a contract.",
 "PrepaidExpenseAndOtherAssetsCurrent": "Amount of asset related to consideration paid in advance for costs that provide economic benefits in future periods, and amount of other assets that are expected to be realized or consumed within one year or the normal operating cycle, if longer."
}